# ---------------------------------------------------------
# 6021 : [기초-입출력] 단어 1개 입력받아 나누어 출력하기(설명)(py)
# ---------------------------------------------------------
# 문제: 본 문제는 python 의 빠른 기초 학습을 위해 설계된 문제로서 python 코드 제출을 기준으로 설명되어 있습니다.
#       ------
#       알파벳과 숫자로 이루어진 단어 1개가 입력된다.
#       입력받은 단어의 각 문자를 한 줄에 한 문자씩 분리해 출력한다.

#       [입력]
#       5개의 문자로 이루어진 단어 1개가 입력된다.
#       [출력]
#       각 문자를 한 줄에 한 문자씩 줄을 바꿔 출력한다.
# ---------------------------------------------------------
word = input()
print(word[0])
print(word[1])
print(word[2])
print(word[3])
print(word[4])

# 메모:
# 정방향이면 0부터~
# 역순이면 -1부터~