# ---------------------------------------------------------
# 6026 : [기초-값변환] 실수 2개 입력받아 합 계산하기(설명)(py)
# ---------------------------------------------------------
# 문제: 본 문제는 python 의 빠른 기초 학습을 위해 설계된 문제로서 python 코드 제출을 기준으로 설명되어 있습니다.
#       ------
#       실수 2개를 입력받아
#       합을 출력하는 프로그램을 작성해보자.
#       [입력]
#       2개의 실수가 줄을 바꿔 입력된다.
#       [출력]
#       두 실수의 합을 출력한다.
# ---------------------------------------------------------
# (여기에 내 풀이)
# 실수 2개 Enter로 input -> 실수로 변경 float -> 두 실수 +
a = float(input())
b = float(input())
print(a+b)

# 메모: 한 번의 input()은 사용자가 Enter를 칠 때까지의 '한 줄'을 가져온다!!!
