# ---------------------------------------------------------
# 6032 : [기초-산술연산] 정수 1개 입력받아 부호 바꾸기(설명)(py)
# ---------------------------------------------------------
# 문제: 본 문제는python의 빠른 기초 학습을 위해 설계된 문제로서python코드 제출을 기준으로 설명되어 있습니다.
#       ------
#       입력된 정수의 부호를 바꿔 출력해보자.
#       	예시
#       	...
#       	print(-n)
#       	참고
#       	단항(unary) 연산자인 -(negative)를 변수 앞에 붙이면 부호가 반대인 값이 된다.
#       [입력]
#       정수 1개가 입력된다.
#       [출력]
#       부호를 바꿔 출력한다.
# ---------------------------------------------------------
# (여기에 내 풀이)
i = int(input())
print(-i)

# 메모: - => 단항연산자
