# ---------------------------------------------------------
# 6037 :  [기초-산술연산] 문장 여러 번 출력하기(설명)(py)
# ---------------------------------------------------------
# 문제: 본 문제는 python 의 빠른 기초 학습을 위해 설계된 문제로서 python 코드 제출을 기준으로 설명되어 있습니다.
#       ------
#       반복 횟수와 문장을 입력받아 여러 번 출력해보자.
#       [입력]
#       반복 횟수와 문장이 줄을 바꿔 입력된다.
#       [출력]
#       입력된 횟수만큼 입력된 문장을 출력한다.
# ---------------------------------------------------------
# (여기에 내 풀이) 
a = input()
b = input()
a = int(a)
print(b * a)

# 메모: