# ---------------------------------------------------------
# 6080 : [기초-종합] 주사위 2개 던지기(설명)(py)
# ---------------------------------------------------------
# 문제: 본 문제는 python 의 빠른 기초 학습을 위해 설계된 문제로서 python 코드 제출을 기준으로 설명되어 있습니다.
#       ------
#       1부터 n까지, 1부터 m까지 숫자가 적힌 서로 다른 주사위 2개를 던졌을 때,
#       나올 수 있는 모든 경우를 출력해보자.

#       [입력]
#       서로 다른 주사위 2개의 면의 개수 n, m이 공백을 두고 입력된다.
#       단, n, m은 10이하의 자연수
#       [출력]
#       나올 수 있는 주사위의 숫자를 한 세트씩 줄을 바꿔 모두 출력한다.
#       첫 번째 수는 n, 두 번째 수는 m으로 고정해 1부터 오름차순 순서로 출력하도록 한다.
# ---------------------------------------------------------
# (여기에 내 풀이)
# for 중첩

# 1. 입력
n, m = input().split()
n = int(n)
m = int(m)

# for 중첩문
for i in range(1, n+1):
    for j in range (1, m+1):
        print(i, j)



# 출력 (a b 형태), 오름차순 upper

# 메모:
#       예시
#       ...
#       for i in range(1, n+1) :
#         for j in range(1, m+1) :
#           print(i, j)
#       ...
#       참고
#       위 코드는
#       바깥쪽의 i 값이 1부터 n까지 순서대로 바뀌는 각각의 동안에
#       안쪽의 j 값이 다시 1부터 m까지 변하며 출력되는 코드이다.
#       조건선택 실행구조 안에 다른 조건선택 실행구조를 넣어 처리할 수 있는 것과 마찬가지로
#       반복 실행구조 안에 다른 반복 실행구조를 넣어 처리할 수 있다.
#       원하는 형태로 실행 구조를 결합하거나 중첩시킬 수 있다.